Soap/customer/ORGANIZATION/ORGANIZATION_Samples/import_ORGANIZATION_Full_Related_IND.xml

   <?xml version="1.0" encoding="utf-8"?>
    <soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
        <soap:Body>
            <AMLYZE_CUSTOMER xmlns="urn:amlyze-services:EvaluateCustomerService_v2r0">
                <CommunicationNumber>ComNr_011119</CommunicationNumber>
                <Requester>Bank system</Requester>
                <RiskManagementCategory>ORG_PK</RiskManagementCategory>
                <EntityType>ORGANIZATION</EntityType>
                <CustomerExtId>extid_012236</CustomerExtId>
                <SourceOfRiskLevel>IMPORT</SourceOfRiskLevel>
                <RiskLevel>MEDIUM</RiskLevel>
                <CustomerStatus>ACTIVE</CustomerStatus>
                <InitializeScreeningProcesses>
                    <Process>SANCTIONS</Process>
                    <Process>PEP</Process>
                    <Process>ADVERSE_MEDIA</Process>
                </InitializeScreeningProcesses>
                <NationalCode>CA123456C</NationalCode>
                <ApplicationDate>2023-01-15</ApplicationDate>
                <ApprovalDate>2023-01-16</ApprovalDate>
                <Title>UAB 'VazeLog'</Title>
                <TradingName>VazeLog</TradingName>
                <EstablishmentDate>2000-04-22</EstablishmentDate>
                <RegistrationCountry>CN</RegistrationCountry>
                <LegalForm>COOPERATIVE</LegalForm>
                <IsListed>true</IsListed>
                <IsAudited>true</IsAudited>
                <NumberOfAudits>5</NumberOfAudits>
                <PeriodsOfAuditsInYears>4</PeriodsOfAuditsInYears>
                <IsFined>true</IsFined>
                <PeriodsOfFiningInYears>2</PeriodsOfFiningInYears>
                <IsRegulated>true</IsRegulated>
                <CompanyAssetValue>10000</CompanyAssetValue>
                <NumberOfEmployees>240</NumberOfEmployees>
                <LEI>LEI124545</LEI>
                <GIIN>GIIN123445</GIIN>
                <NoMajorShareHolders>true</NoMajorShareHolders>
                <IsDirectlyManaged>true</IsDirectlyManaged>
                <HasMultiLayerStructure>true</HasMultiLayerStructure>
                <OrganizationalStructureDescription>Super hierarchical organizational structure</OrganizationalStructureDescription>
                <RegionOfActivityDescription>BAL</RegionOfActivityDescription>
                <ActivityInRestrictedRegionDescription>EUROPA</ActivityInRestrictedRegionDescription>
                <IsLicenseRequired>false</IsLicenseRequired>
                <LicenseDescription>Licence No.4547</LicenseDescription>
                <IsFinancialInstitution>true</IsFinancialInstitution>
                <ThirdPartyServicesUsed>false</ThirdPartyServicesUsed>
                <ThirdPartyServicesUsedDescription>Description of third party services</ThirdPartyServicesUsedDescription>
                <ListRelatedEntity>
                    <RelatedEntity>
                        <RelationType>SHAREHOLDER</RelationType>
                        <EntityType>INDIVIDUAL</EntityType>
                        <RelationDescription>Cofounder</RelationDescription>
                        <Share>47</Share>
                        <VotePercentage>90</VotePercentage>
                        <NationalCode>38254121212</NationalCode>
                        <Country>AF</Country>
                        <ActivityDescription>holds a substantial ownership interest</ActivityDescription>
                        <RegistrationCountry>LT</RegistrationCountry>
                        <CountryOfBusinessOperations>AF</CountryOfBusinessOperations>
                        <FirstName>Teodor</FirstName>
                        <LastName>Mariko</LastName>
                        <BirthDate>1991-09-15</BirthDate>
                        <BirthCountry>LT</BirthCountry>
                        <IsPEP>true</IsPEP>
                        <IsSanctioned>true</IsSanctioned>
                        <IsInAdverseMedia>true</IsInAdverseMedia>
                        <RegionOfActivityDescription>Western Region</RegionOfActivityDescription>
                        <ListContact>
                            <Contact>
                                <ContactType>MOBILEPHONE</ContactType>
                                <ContactDetails>+37057482983</ContactDetails>
                                <UseForCommunication>true</UseForCommunication>
                            </Contact>
                        </ListContact>
                        <ListAddress>
                            <Address>
                                <AddressType>RESIDENCE</AddressType>
                                <AddressDetails>Henry St.</AddressDetails>
                                <Country>LT</Country>
                                <Region>EU</Region>
                                <City>Kenmare</City>
                                <StreetAddress>Henry St.</StreetAddress>
                                <ZipCode>01103</ZipCode>
                                <UseForCorrespondence>true</UseForCorrespondence>
                            </Address>
                        </ListAddress>
                        <ListIncomeSource>
                            <IncomeSource>
                                <IncomeSourceType>PASSIVE_INCOME</IncomeSourceType>
                                <IncomePercentage>54</IncomePercentage>
                                <From>49</From>
                                <To>50</To>
                            </IncomeSource>
                        </ListIncomeSource>
                        <ListActivity>
                            <Activity>
                                <ActivityType>9</ActivityType>
                                <IncomePercentage>74</IncomePercentage>
                            </Activity>
                            <Activity>
                                <ActivityType>5</ActivityType>
                                <IncomePercentage>50</IncomePercentage>
                            </Activity>
                            <Activity>
                                <ActivityType>10</ActivityType>
                                <IncomePercentage>74</IncomePercentage>
                            </Activity>
                        </ListActivity>
                        <ListRegionOfActivity>
                            <RegionOfActivity>
                                <Region>EU</Region>
                            </RegionOfActivity>
                        </ListRegionOfActivity>
                        <ListCountryOfActivity>
                            <CountryOfActivity>
                                <Country>AL</Country>
                            </CountryOfActivity>
                        </ListCountryOfActivity>
                    </RelatedEntity>
                </ListRelatedEntity>
                <IsSanctioned>false</IsSanctioned>
                <IsPEP>false</IsPEP>
                <IsInAdverseMedia>false</IsInAdverseMedia>
                <IsActualAddressDeclared>true</IsActualAddressDeclared>
                <IsCorrespondenceAddressDeclared>true</IsCorrespondenceAddressDeclared>
                <ActivityDescription>financial products and services, including retail banking, corporate banking, investment banking, and insurance services.</ActivityDescription>
                <IncomeSourceDescription>Dividend</IncomeSourceDescription>
                <InitialDepositSource>Dividend other</InitialDepositSource>
                <InitialDepositAmount>10000</InitialDepositAmount>
                <InitialDepositCurrency>USD</InitialDepositCurrency>
                <InitialDepositBank>Bank of Lithuania</InitialDepositBank>
                <InitialDepositAccount>LT4741210540135195221</InitialDepositAccount>
                <DoesCashDominate>true</DoesCashDominate>
                <IncomingPaymentDescription>Incoming Payment</IncomingPaymentDescription>
                <OutgoingPaymentDescription>Outgoing Payment</OutgoingPaymentDescription>
                <ListContact>
                    <Contact>
                        <ContactType>EMAIL</ContactType>
                        <ContactDetails>VazeLog@yahoo.com</ContactDetails>
                        <UseForCommunication>true</UseForCommunication>
                    </Contact>
                    <Contact>
                        <ContactType>MOBILEPHONE</ContactType>
                        <ContactDetails>+3504872546</ContactDetails>
                        <UseForCommunication>true</UseForCommunication>
                    </Contact>
                </ListContact>
                <ListAddress>
                    <Address>
                        <AddressType>RESIDENCE</AddressType>
                        <AddressDetails>19/2</AddressDetails>
                        <Country>PT</Country>
                        <Region>EA</Region>
                        <City>Porto</City>
                        <StreetAddress>Khashuri St.</StreetAddress>
                        <ZipCode>01105</ZipCode>
                        <UseForCorrespondence>true</UseForCorrespondence>
                    </Address>
                    <Address>
                        <AddressType>RESIDENCE</AddressType>
                        <AddressDetails>15/2</AddressDetails>
                        <Country>PT</Country>
                        <Region>EA</Region>
                        <City>Lisboa</City>
                        <StreetAddress>Dandov St.</StreetAddress>
                        <ZipCode>01805</ZipCode>
                        <UseForCorrespondence>true</UseForCorrespondence>
                    </Address>
                </ListAddress>
                <ListBusinessEntityDocument>
                    <BusinessEntityDocument>
                        <EntityType>INDIVIDUAL</EntityType>
                        <IdentityDocumentType>PASSPORT</IdentityDocumentType>
                        <DocumentNumber>D0KN045454545</DocumentNumber>
                        <DocumentIssueDate>2015-09-20</DocumentIssueDate>
                        <DocumentExpiryDate>2025-09-20</DocumentExpiryDate>
                        <DocumentIssueCountry>PT</DocumentIssueCountry>
                        <DocumentIssueAuthority>National Migration Service</DocumentIssueAuthority>
                        <Description>Main identification document</Description>
                    </BusinessEntityDocument>
                    <BusinessEntityDocument>
                        <EntityType>ORGANIZATION</EntityType>
                        <IdentityDocumentType>REGISTRATIONCERTIFICATE</IdentityDocumentType>
                        <DocumentNumber>D0KN045454545</DocumentNumber>
                        <DocumentIssueDate>2017-08-20</DocumentIssueDate>
                        <DocumentExpiryDate>2027-08-20</DocumentExpiryDate>
                        <DocumentIssueCountry>LV</DocumentIssueCountry>
                        <DocumentIssueAuthority>Federal Tax Service</DocumentIssueAuthority>
                        <Description>Main identification document</Description>
                    </BusinessEntityDocument>
                </ListBusinessEntityDocument>
                <ListAppealReason>
                    <AppealReason>
                        <AppealReasonType>PURPOSE_INVEST</AppealReasonType>
                    </AppealReason>
                </ListAppealReason>
                <ListIntroductionSource>
                    <IntroductionSource>
                        <IntroductionSource>Introducer</IntroductionSource>
                    </IntroductionSource>
                </ListIntroductionSource>
                <ListOrderedService>
                    <OrderedService>
                        <ServiceType>LOANS</ServiceType>
                    </OrderedService>
                    <OrderedService>
                        <ServiceType>CHECKINGACCOUNT</ServiceType>
                    </OrderedService>
                    <OrderedService>
                        <ServiceType>CURRENCY_EXCHANGE</ServiceType>
                    </OrderedService>
                    <OrderedService>
                        <ServiceType>CREDIT_LINE</ServiceType>
                    </OrderedService>
                </ListOrderedService>
                <ListDeclaredTurnover>
                    <DeclaredTurnover>
                        <TurnoverType>EXPECTED_AVERAGE_AMOUNT_OF_INCOMING_PAYMENT</TurnoverType>
                        <TurnoverRange>MONTHLY</TurnoverRange>
                        <From>5000</From>
                        <To>12000</To>
                    </DeclaredTurnover>
                    <DeclaredTurnover>
                        <TurnoverType>CASH_PERCENTAGE</TurnoverType>
                        <TurnoverRange>ANNUAL</TurnoverRange>
                        <From>15</From>
                        <To>85</To>
                    </DeclaredTurnover>
                </ListDeclaredTurnover>
                <ListIncomeSource>
                    <IncomeSource>
                        <IncomeSourceType>SEASONAL_ACTIVITIES</IncomeSourceType>
                        <IncomePercentage>68</IncomePercentage>
                        <From>6</From>
                        <To>26</To>
                    </IncomeSource>
                </ListIncomeSource>
                <ListPaymentPurpose>
                    <PaymentPurpose>
                        <TurnoverDirection>OUT</TurnoverDirection>
                        <PaymentPurposeType>TAXES</PaymentPurposeType>
                    </PaymentPurpose>
                    <PaymentPurpose>
                        <TurnoverDirection>IN</TurnoverDirection>
                        <PaymentPurposeType>PAYMENT_FOR_SERVICES</PaymentPurposeType>
                    </PaymentPurpose>
                    <PaymentPurpose>
                        <TurnoverDirection>IN</TurnoverDirection>
                        <PaymentPurposeType>RENT_AND_UTILITIES</PaymentPurposeType>
                    </PaymentPurpose>
                </ListPaymentPurpose>
                <ListSourceOfWealth>
                    <SourceOfWealth>
                        <SourceOfWealthCode>10</SourceOfWealthCode>
                        <Value>1000</Value>
                        <Comment>Rent</Comment>
                    </SourceOfWealth>
                </ListSourceOfWealth>
                <ListPaymentCountry>
                    <PaymentCountry>
                        <Country>RU</Country>
                        <TurnoverDirection>OUT</TurnoverDirection>
                    </PaymentCountry>
                    <PaymentCountry>
                        <Country>AF</Country>
                        <TurnoverDirection>OUT</TurnoverDirection>
                    </PaymentCountry>
                    <PaymentCountry>
                        <Country>RU</Country>
                        <TurnoverDirection>IN</TurnoverDirection>
                    </PaymentCountry>
                </ListPaymentCountry>
                <ListActivity>
                    <Activity>
                        <ActivityType>7</ActivityType>
                        <IncomePercentage>48</IncomePercentage>
                    </Activity>
                    <Activity>
                        <ActivityType>5</ActivityType>
                        <IncomePercentage>48</IncomePercentage>
                    </Activity>
                </ListActivity>
                <ListRegionOfActivity>
                    <RegionOfActivity>
                        <Region>AZIA</Region>
                    </RegionOfActivity>
                </ListRegionOfActivity>
                <ListCountryOfActivity>
                    <CountryOfActivity>
                        <Country>CN</Country>
                    </CountryOfActivity>
                </ListCountryOfActivity>
                <ListCountryOfTaxPayment>
                    <CountryOfTaxPayment>
                        <Country>CN</Country>
                        <TaxpayerNumber>TAXNO1111112</TaxpayerNumber>
                    </CountryOfTaxPayment>
                </ListCountryOfTaxPayment>
                <ListAdditionalValues>
                    <AdditionalValue>
                        <Code>is_related_to_Lithuania</Code>
                        <Description>Entity is related to lirhuania?</Description>
                        <Datatype>BOOLEAN</Datatype>
                        <Value>true</Value>
                    </AdditionalValue>
                    <AdditionalValue>
                        <Code>active_users_online</Code>
                        <Description>How many users where online in last 30min</Description>
                        <Datatype>STRING</Datatype>
                        <Value>15000</Value>
                    </AdditionalValue>
                    <AdditionalValue>
                        <Code>last_user_online</Code>
                        <Description>The last time user was online</Description>
                        <Datatype>TIMESTAMP</Datatype>
                        <Value>2022-12-12T12:10:11Z</Value>
                    </AdditionalValue>
                    <AdditionalValue>
                        <Code>average_client's_age</Code>
                        <Description>The value provides an average age of our customer</Description>
                        <Datatype>INTEGER</Datatype>
                        <Value>26</Value>
                    </AdditionalValue>
                    <AdditionalValue>
                        <Code>average_client's_deposit</Code>
                        <Description>Value provides the average ammount of deposit in dollars</Description>
                        <Datatype>DECIMAL</Datatype>
                        <Value>852.85</Value>
                    </AdditionalValue>
                </ListAdditionalValues>
            </AMLYZE_CUSTOMER>
        </soap:Body>
    </soap:Envelope>